# Cleaning Data With Pandas

In this exercise, we load data from an Excel spreadsheet, clean the dataset, then save the cleaned data to a new Excel sheet.

This dataset contains a list of 891 of the passengers on board including variables (columns) such as Name, Age, Sex, and Pclass i.e. whether they travelled 1st, 2nd or 3rd class.  We need to clean the data.  Some variables have missing values.  The names of the variables, are cryptic and so are the values. This file is at a public web location - the URL is provided.  The workbook has several sheets, the passenger data is in a sheet named 'Passengers'.

Here are some suggested data quality improvements:
* Remove the Ticket and Cabin columns (we don’t need them in this exercise).
* split the Name column into three columns: last_name, title and other_names.  
* The Survived column has two values 0 and 1 to indicate whether the passenger died or survived.  These values are not intuitive.  Create a new column survival, with values 'Died' or 'Survived' based on the value of the Survived column (0 and 1 respectively).
* The Pclass column has values 1, 2 and 3.  Perhaps integer values are not best in this case – is a 2nd class passenger somehow twice as much as a 1st class? Create a new column passenger_class with values '1st', '2nd' and '3rd'.
* In the Embarked column, replace S, C and Q values with Southampton, Cherbourg and Queenstown respectively.  Deal with the two empty values.
* add a column family_size, with formula = [SibSp]+[Parch]+1
* remove any further columns we no longer need e.g. Survived
* rename any columns to a more Pythonic style with lowercase and underscore style e.g.PassengerId -> passenger_id 

### Background
Almost everyone knows the story of the Titanic.  In April 1912, this magnificent ship left Southampton on its maiden voyage to New York but it never arrived.  It hit an iceberg in the Atlantic and sank.  There were over 2,000 people on board.  Less than half survived.
A century later, this Titanic dataset is a classic case study for rookie data scientist to build a predictive model to determine who is likely to survive or perish (ignoring the fact that this is a matter of historical record). However, we will visualise the data with Power BI and see if we can gain some intuition and who did and did not survive and why.  We know from the film that Kate Winslet survived but poor old Leo DiCaprio did not – is that an accurate reflection?

Note: we may need to pip install pandas, numpy, openpyxl (a dependency of pandas required for opening Excel sheets)

In [2]:
import pandas as pd
import numpy as np

The Excel file is at this location

In [3]:
file_url = "https://github.com/MarkWilcock/CourseDatasets/raw/main/Misc%20Datasets/Titanic%20Data.xlsx"

This next code cell loads the data in the Passengers sheet of an Excel file at the file_url into a pandas DataFrame

In [4]:
df = pd.read_excel(file_url,sheet_name="Passengers")
df.head(2) # Show first 2 rows

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1

Remove the Cabin and Ticket columns.  Use the drop() method of the DataFrame class.
This method returns a changed DataFrame but does not by default change the original DataFrame so we have two options
* assign the DataFrame as the result i.e., df = df.drop(.....)
* use the inplace argument to change the default behaviour

In [5]:
# Write your code here
df.drop(columns=['Cabin', 'Ticket'], inplace=True)
df.head(2) # Show first 2 rows

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1

The next code cell shows how to create a new column, passenger_class, with values based on the values in Pclass column.  
The values are mapped from Pclass: 1 to 1st, 2 to 2nd, 3 to 3rd.
It uses the map function and a dictionary of old and new values.  
Finally it drops the Pclass column as it is no longer needed

In [6]:
df['passenger_class'] = df['Pclass'].map({1:'1st', 2:'2nd', 3:'3rd'})
df.drop(columns='Pclass')
df.head(2) # Show first 2 rows

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived,passenger_class
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,0,3rd
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1,1st

Use the same tehnique to add a column named survival with values based on the values in the Survived column.  
Map values of 0 to No, 1 to Yes.  
Finally drop the Survived column.

In [7]:
# Write your code here
df['survival'] = df['Survived'].map({0:'Died', 1:'Survived'})
df.drop(columns='Survived')
df.head(2) # Show first 2 rows

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived,passenger_class,survival
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,0,3rd,Died
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1,1st,Survived

Add a column, family_size, calculated as SibSp + Parch + 1. 
 
Explanation: For each passenger, the family size the sum of:
1. the number of parents and children (Parch), 
1. the number of siblings and spouses (SibSp), 
1. the passenger themselves

In [8]:
# Write your code here
df['family_size'] = df['SibSp'] + df['Parch'] + 1
df.head(2) # Show first 2 rows

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived,passenger_class,survival,family_size
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,0,3rd,Died,2
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1,1st,Survived,2

Replace the values of the Embarked column with the full words, C to Cherbourg, Q to Queenstown, S to Southampton.
Use either the DataFrame map or replace method

In [9]:
# Write your code here
df['Embarked'] = df['Embarked'].map({'C':'Cherbourg', 'Q':'Queenstown', 'S':'Southampton'})
#df.Embarked = df.Embarked.replace({'C':'Cherbourg1', 'Q':'Queenstown1', 'S':'Southampton1'})
df.head(2) # Show first 2 rows

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived,passenger_class,survival,family_size
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,Southampton,0,3rd,Died,2
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,Cherbourg,1,1st,Survived,2

Split the Name column into three columns: last_name, title and other_names.  

You may want to use the following arguments and values in the split() function
* expand=True: This ensures that the result of the split operation is a DataFrame with separate columns for each split component.
* n=1: This limits the split to at most 1 time. So, the string will be split into two parts: everything before the first delimter, and everything after it. This is useful when the  delimiter may appear more than once and we only want the first occurrence to split the string.

In [10]:
# Write your code here
df[['last_name', 'remainder']] = df['Name'].str.split(',', expand=True, n=1)
df[['title', 'other_names']] = df['remainder'].str.split('.', expand=True, n=1)
df.drop(columns=['remainder', 'Name'], inplace=True)

df.head(2) # Show first 2 rows

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Survived,passenger_class,survival,family_size,last_name,title,other_names
0,1,3,male,22.0,1,0,7.2500,Southampton,0,3rd,Died,2,Braund,Mr,Owen Harris
1,2,1,female,38.0,1,0,71.2833,Cherbourg,1,1st,Survived,2,Cumings,Mrs,John Bradley (Florence Briggs Thayer)

Empty values of Age, presumably np.nan values in Python, are shown as #NUM! in Excel, so need to replace - an empty string seems best.

In [11]:
df.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [12]:
print("Age column stats:\n", df.Age.describe())

print("One row in final five rows has missing value for Age:\n", df.tail())

print(":\n")
df.Age.isna()

Age column stats:
 count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64
One row in final five rows has missing value for Age:
      PassengerId  Pclass     Sex   Age  SibSp  Parch   Fare     Embarked  \
886          887       2    male  27.0      0      0  13.00  Southampton
887          888       1  female  19.0      0      0  30.00  Southampton
888          889       3  female   NaN      1      2  23.45  Southampton
889          890       1    male  26.0      0      0  30.00    Cherbourg
890          891       3    male  32.0      0      0   7.75   Queenstown

     Survived passenger_class  survival  family_size last_name  title  \
886         0             2nd      Died            1  Montvila    Rev
887         1             1st  Survived            1    Graham   Miss
888         0             3rd      Died            4  Johnston   Miss
889         1             1st  Survived            1      Behr     Mr
890         0             3rd      Died            1    Dooley     Mr

                   other_names
886                     Juozas
887             Margaret Edith
888   Catherine Helen "Carrie"
889                Karl Howell
890                    Patrick
:

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [13]:
# Write your code here
df['age'] = df.Age.replace(np.nan, '')
df.tail() # the last 5 contain a row with nan values of Age

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Survived,passenger_class,survival,family_size,last_name,title,other_names,age
886,887,2,male,27.0,0,0,13.00,Southampton,0,2nd,Died,1,Montvila,Rev,Juozas,27.0
887,888,1,female,19.0,0,0,30.00,Southampton,1,1st,Survived,1,Graham,Miss,Margaret Edith,19.0
888,889,3,female,NaN,1,2,23.45,Southampton,0,3rd,Died,4,Johnston,Miss,"Catherine Helen ""Carrie""",
889,890,1,male,26.0,0,0,30.00,Cherbourg,1,1st,Survived,1,Behr,Mr,Karl Howell,26.0
890,891,3,male,32.0,0,0,7.75,Queenstown,0,3rd,Died,1,Dooley,Mr,Patrick,32.0

Remove the columns we no longer need

In [14]:
# Write your code here
df.drop(columns=['SibSp', 'Parch', 'Pclass', 'Survived', 'Age'], inplace=True)
df.head(2) # Show first 2 rows

,PassengerId,Sex,Fare,Embarked,passenger_class,survival,family_size,last_name,title,other_names,age
0,1,male,7.2500,Southampton,3rd,Died,2,Braund,Mr,Owen Harris,22.0
1,2,female,71.2833,Cherbourg,1st,Survived,2,Cumings,Mrs,John Bradley (Florence Briggs Thayer),38.0

Rename any columns to a more Pythonic style with lowercase and undercscore style e.g.PassengerId -> passenger_id   
Use the DataFrame rename method with a dictionary to map old names (key) to new names (value)

In [15]:
# Write your code here
names_dict = {'PassengerId':'passenger_id', 'Sex': 'sex', 'Fare': 'fare', 'Embarked': 'embarked' }
df.rename(columns=names_dict, inplace=True)
df.head(2) # Show first 2 rows

,passenger_id,sex,fare,embarked,passenger_class,survival,family_size,last_name,title,other_names,age
0,1,male,7.2500,Southampton,3rd,Died,2,Braund,Mr,Owen Harris,22.0
1,2,female,71.2833,Cherbourg,1st,Survived,2,Cumings,Mrs,John Bradley (Florence Briggs Thayer),38.0

Saved this cleaned DataFrame to an Excel file in the local folder. Name this file "titanic_clean.xlsx"
Use the DataFrame to_excel method

In [16]:
# Write your code here
# If we are using Colab, we may need to uncomment the next code cell to save the clean data to a file on your Google drive
#from google.colab import drive
#drive.mount('/drive')
df.to_excel("titanic_clean.xlsx", index=False)

## Filtering the dataset

Return a filtered DataFrame of 2nd class passengers

In [17]:
# Write your code here
second_class_passengers = df.loc[df['passenger_class'] == '2nd']
second_class_passengers

,passenger_id,sex,fare,embarked,passenger_class,survival,family_size,last_name,title,other_names,age
9,10,female,30.0708,Cherbourg,2nd,Survived,2,Nasser,Mrs,Nicholas (Adele Achem),14.0
15,16,female,16.0000,Southampton,2nd,Survived,1,Hewlett,Mrs,(Mary D Kingcome),55.0
17,18,male,13.0000,Southampton,2nd,Survived,1,Williams,Mr,Charles Eugene,
20,21,male,26.0000,Southampton,2nd,Died,1,Fynney,Mr,Joseph J,35.0
21,22,male,13.0000,Southampton,2nd,Survived,1,Beesley,Mr,Lawrence,34.0
...,...,...,...,...,...,...,...,...,...,...,...
866,867,female,13.8583,Cherbourg,2nd,Survived,2,Duran y More,Miss,Asuncion,27.0
874,875,female,24.0000,Cherbourg,2nd,Survived,2,Abelson,Mrs,Samuel (Hannah Wizosky),28.0
880,881,female,26.0000,Southampton,2nd,Survived,2,Shelley,Mrs,William (Imanita Parrish Hall),25.0
883,884,male,10.5000,Southampton,2nd,Died,1,Banfield,Mr,Frederick James,28.0
886,887,male,13.0000,Southampton,2nd,Died,1,Montvila,Rev,Juozas,27.0

Return a filtered DataFrame of women who embarked at Cherbourg and travelled 2nd class

In [18]:
# Write your code here
second_class_women_cherbourg = df[(df['passenger_class'] == '2nd') & (df['sex'] == 'female') & (df['embarked'] == 'Cherbourg')]
second_class_women_cherbourg

,passenger_id,sex,fare,embarked,passenger_class,survival,family_size,last_name,title,other_names,age
9,10,female,30.0708,Cherbourg,2nd,Survived,2,Nasser,Mrs,Nicholas (Adele Achem),14.0
43,44,female,41.5792,Cherbourg,2nd,Survived,4,Laroche,Miss,Simonne Marie Anne Andree,3.0
389,390,female,12.0000,Cherbourg,2nd,Survived,1,Lehmann,Miss,Bertha,17.0
473,474,female,13.7917,Cherbourg,2nd,Survived,1,Jerwan,Mrs,Amin S (Marie Marthe Thuillard),23.0
608,609,female,41.5792,Cherbourg,2nd,Survived,4,Laroche,Mrs,Joseph (Juliette Marie Louise Lafargue),22.0
866,867,female,13.8583,Cherbourg,2nd,Survived,2,Duran y More,Miss,Asuncion,27.0
874,875,female,24.0000,Cherbourg,2nd,Survived,2,Abelson,Mrs,Samuel (Hannah Wizosky),28.0